pos-system-tfa4/app/Controllers/Auth.php

    public function attemptLogin()
    {
        $rules = [
            'username' => 'required',
            'password' => 'required'
        ];

        // Check if username/password fields are empty
        if (!$this->validate($rules)) {
            return view('login', [
                'validation' => $this->validator
            ]);
        }

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();

        // Find the user by username
        $user = $userModel
            ->where('username', $username)
            ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'sadh'
 LIMIT 1