pos-system-tfa4/app/Controllers/Customers.php

    public function index()
    {
        $customerModel = new CustomerModel();

        $data['customers'] = $customerModel->findAll();
---
SELECT *
FROM `customers`